In [ ]:
# Host where MySQL is running (e.g. localhost)
--host / -h

# Port number (default is 3306)
--port / -P

# Username (default is root)
--user / -u

# Prompts for password securely
--password / -p

# help
--help

# exit a unfinished command
\c

# Ready for a new command
mysql>

# Waiting for more input
->

# Waiting for closing quote
'>

# Waiting for closing backtick
``>`

# Clear screen
system clear; or Ctrl+L

# Comments
Single-line: -- comment
Multi-line: /* comment */
    
    
# CRUD
Create, read, update and delete

In [ ]:
# Start server
sudo service mysql start

# check it is running
sudo service mysql status

# check using ping
sudo mysqladmin ping

# log in as MySQL root (socket auth)
sudo mysql

# log in through jupyter <- user jovyan
mysql -u jovyan -p -h 127.0.0.1

# Force TCP connection
mysql -u user -p -h 127.0.0.1

# Log out
exit or quit

# add a user
sudo usermod -aG mysql jovyan

# verify a user
SELECT user, host FROM mysql.user WHERE user='jovyan';

# see how you are connected
SELECT USER();

# see what permissions you are using
SELECT CURRENT_USER();

# list all databases
SHOW DATABASES;

# show current database
SELECT DATABASE();

# switch database
USE db_name;

# list tables
SHOW TABLES;

# Show table creation DDL
SHOW CREATE TABLE table_name;

# Create table if not exists
CREATE TABLE IF NOT EXISTS table_name;

# Describe table structure
DESCRIBE table_name; or SHOW COLUMNS FROM table_name;

# Peek table data
SELECT * FROM table_name LIMIT 5;

# Find tables by name
SHOW TABLES LIKE '%pattern%';

# Check if table exists
SELECT table_name, column_name, data_type FROM information_schema.columns WHERE table_schema='db';

# Check user permissions
SHOW GRANTS;

# delete a table
DROP TABLE IF EXISTS table_name;

# change database name SQL server
ALTER DATABASE db_name MO0DIFY NAME = new_db_name

# change name / transfer all tables from old database to new one
RENAME TABLE old_db_name.table1 TO new_db_name.table1

# create table from existing table
CREATE TABLE new_table AS SELECT column1, column2 FROM extisting_table WHERE ...;

# Rename table
ALTER TABLE table_name RENAME TO new_table_name;

# Rename a column
ALTER TABLE table_name RENAME COLUMN cold_column TO new_column_name;

# Add new column
ALTER TABLE table_name ADD column_name datatyoe;

# modify column data type
ALTER TABLE table_name MODIFY COLUMN column_name new_datatype;

# select column
SELECT column FROM table;

# select all columns
SELECT * FROM table;

# clone table simple (constraints like primary keys, unique keys, and auto-increment properties are not preserved)
CREATE TABLE db_copy AS SELECT * FROM db_orig;

# clone table shallow (same structure but not copy data)
CREATE TABLE db_shallow LIKE db_orig;

# clone deep
CREATE TABLE clone_table LIKE original_table;
INSERT INTO clone_table SELECT * FROM original_table;

# Add values to a new row
INSERT INTO table (column1, column2, column3) VALUES (1, 'string', 2)

# Add multiple rows
INSERT INTO table_name (column1, column2, ...) VALUES (value1, value2, ...), (value1, value2, ...), (value1, value2, ...);

# modify data in a table
UPDATE table_name 
SET column1 = value1, column2 = value2,... 
WHERE condition

# modify multiple columns
UPDATE Customer 
SET Name = 'John', 
Country = 'Spain' 
WHERE CustomerID = 1;

# Identify Duplicate Rows
SELECT Name, Department, COUNT(*)
FROM Employee
GROUP BY Name, Department
HAVING COUNT(*) > 1;

In [ ]:
# Create MySQL user for jupyter
CREATE USER 'jovyan'@'%'
IDENTIFIED WITH mysql_native_password
BY 'strong_password';

GRANT ALL PRIVILEGES ON *.* TO 'jovyan'@'%';
FLUSH PRIVILEGES;


# Change password
ALTER USER 'jovyan'@'%'
IDENTIFIED WITH mysql_native_password
BY 'MyNewSecurePassword123!';
FLUSH PRIVILEGES;


# Delete user
DROP USER IF EXISTS 'jovyan'@'localhost';
FLUSH PRIVILEGES;
#or
DROP USER IF EXISTS 'jovyan'@'%';
FLUSH PRIVILEGES;


# check table size
SELECT
  table_name,
  ROUND((data_length + index_length) / 1024 / 1024, 2) AS size_mb
FROM information_schema.tables
WHERE table_schema = DATABASE()
ORDER BY size_mb DESC;

In [ ]:
# Create database
CREATE DATABASE mysql_db;

# Use database
USE mysql_db;

# Create table with a name
CREATE TABLE table1 (
    id INT AUTO_INCREMENT PRIMARY KEY,
    column1 VARCHAR(255)
);

# Insert message into table
INSERT INTO table1 (column1)
VALUES ('Test string');

# view string added
SELECT column1 FROM table1;

In [ ]:
# create temporary table
CREATE TABLE #Tmptable (id INT, name VARCHAR(25))  

# Insert Values Into Temporary Table
INSERT INTO #Tmptable VALUES (01, 'Lalit'), (02, 'Atharva') 

# Select Values from the Temporary Table
SELECT * FROM #Tmptable 

# local temp table
CREATE TABLE #Tmptable

# global temp table
CREATE TABLE ##Tmptable

In [ ]:
# transcation to do multiple commands but if any fail it all gets rolled back
BEGIN TRANSACTION;

    INSERT INTO Customers (CustomerID, CustomerName, ContactName, Country)
    VALUES (5, 'Sarah White', 'John White', 'Canada');
    
    INSERT INTO Customers (CustomerID, CustomerName, ContactName, Country)
    VALUES (6, 'Mohamed Ibrahim', 'Ahmed Ibrahim', 'UAE');
    
    -- If any error occurs, the transaction will be rolled back

COMMIT;

## Data Definition Language (DDL)

In [ ]:
# Creates a new table, a view on a table, or some other object in the database
CREATE

# Modifies an existing database object, such as a table
ALTER

# Deletes an entire table, a view of a table, or other objects in the database
DROP

# Removes all records from a table but keeps the table structure intact
TRUNCATE

# It is used to change the name of an existing database object, such as a table
RENAME

# Add comments to the data dictionary
COMMENT

## Data Manipulation Language (DML)

In [ ]:
# Creates a record
INSERT

# Modifies records
UPDATE

# Deletes records
DELETE

## Data Query Language (DQL)

In [ ]:
# Filter and return results from SQL table
SELECT

### clauses of SELECT

In [ ]:
# Indicates the table(s) from which to retrieve data
FROM

# Filters rows before any grouping or aggregation
WHERE

# Groups rows that have the same values in specified columns.
GROUP BY

# Filters the results of GROUP BY
HAVING

# Removes duplicate rows from the result set
DISTINCT

# Sorts the result set by one or more columns
ORDER BY

# By default, it sorts in ascending order unless specified as DESC
LIMIT

## Data Control language (DCL)

In [ ]:
# Gives a privilege to the user
GRANT

# Takes back privileges granted by the user
REVOKE

## Transaction Control Language (TCL)

In [ ]:
# Saves all changes made during the current transaction on a permanent basis. Some databases provide an auto-commit feature, which can be configured using settings.
COMMIT

# Reverts changes made during the current transaction, ensuring no unwanted changes are saved.
ROLLBACK

# Sets a point within a transaction to which changes can be rolled back, allowing partial rollbacks
SAVEPOINT

# Starts a new transaction
BRGIN TRANSACTION

# Data types

## Exact numeric

In [ ]:
# Large integer numbers (-9,223,372,036,854,775,808 to 9,223,372,036,854,775,807)
BIGINT

# Standard integer values (-2,147,483,648 to 2,147,483,647)
INT

# Small integers (-32,768 to 32,767)
SMALLINT

# Very small integers (0 to 255)
TINYINT

# Exact fixed-point numbers (e.g., for financial values) (-10^38 + 1 to 10^38 - 1)
DECIMAL

# Similar to DECIMAL, used for precision data (-10^38 + 1 to 10^38 - 1)
NUMERIC

## Approximate Numeric Datatype

In [ ]:
# Approximate numeric values (-1.79E+308 to 1.79E+308)
FLOAT

# Similar to FLOAT, but with less precision (-3.40E+38 to 3.40E+38)
REAL

## Character and String Data Types

In [ ]:
# The maximum length of 8000 characters. (Fixed-Length non-Unicode Characters)
Char

# The maximum length of 8000 characters. (Variable-Length non-Unicode Characters)
Varchar

# The maximum length of 2^31 - 1 characters(SQL Server 2005 only). (Variable Length non-Unicode data)
Varchar(max)

# The maximum length of 2,127,483,647 characters(Variable Length non-Unicode data)
Text

## Unicode Character String Data Types

In [ ]:
# The maximum length of 4000 characters(Fixed-Length Unicode Characters)
Nchar

# The maximum length of 4000 characters.(Variable-Length Unicode Characters)
Nvarchar

# The maximum length of 2^31 - 1 characters(SQL Server 2005 only). (Variable Length Unicode data)
Nvarchar(max)

## Date and Time Data Type

In [ ]:
# stores the data of date (year, month, day) (3 Bytes)
DATE

# stores the data of time (hour, minute,second) (3 Bytes)
TIME

# store both the data and time (year, month, day, hour, minute, second) (8 Bytes)
DATETIME

## Binary Data Types in SQL

In [ ]:
# Fixed-length binary data (8000 bytes)
Binary

# Variable-length binary data (8000 bytes)
VarBinary

# Stores binary data as images (2,147,483,647 bytes)
Image

## Boolean Data Type in SQL

In [ ]:
1 == True
0 == False

## Special Data Types

In [ ]:
XML Data Type: Used to store XML data and manipulate XML structures in the database

# Operators

## Arithmetric operators

In [ ]:
# Addition
+

# Subtraction
-

# Multiplication
*

# Division
/

# Modulus (Remainder)
%

# Examples
SELECT
    Name,
    Salary,
    Bonus,
    Salary + Bonus AS Total_Income,          -- Addition
    Salary - Bonus AS After_Bonus_Deduction, -- Subtraction
    Salary * 0.10 AS Ten_Percent_Salary,     -- Multiplication
    Salary / 12 AS Monthly_Salary,           -- Division
    Salary % 10000 AS Salary_Remainder       -- Modulus
FROM Table1;

## Comparison operators

In [ ]:
# Equal to
=

# Doesn't equal to
!=

# Greater than
>

# Less than
<

# Grater than or equal to
>=

# Less than or equal to
<=

# Not equal to
<>

# Example
SELECT * FROM Table1 WHERE Column1 >= 70;

## Logical operators

In [ ]:
# combine two or more conditions in an SQL query
AND

# checking whether a value matches any value from a specified list
IN

# used to reverse the result of a condition, returning TRUE when the condition is FALSE
NOT

# combines multiple conditions in a SQL query and returns TRUE if at least one of the conditions is satisfied
OR

# used in the WHERE clause to search for a specified pattern in a column. It is particularly useful when we want to perform pattern matching on string data
LIKE

# LIKE wildcards:
% : Represents zero or more characters. It allows matching any sequence of characters in the string.
_ : Represents exactly one character. It is used when you want to match a specific number of characters at a given position.
    
# test if a value or expression lies within a specified range
BETWEEN

# compare a value to all values returned by a subquery
ALL

# compare a value with the results of a subquery
ANY

# check whether a subquery returns any rows
EXISTS

# Used with comparison operators (<, >, =, <=, etc.) to compare a value against subquery results. Returns TRUE if the condition is satisfied for at least one value from the subquery. Useful for matching a value against multiple possible results instead of just one.
SOME

## Like operators

In [ ]:
# wild cards
% (Percent): Represents zero or more characters
_ (Underscore): Represents a single character
[] (Square Brackets): Represents any single character within brackets
- (Hyphen): Specify a range of characters inside brackets
    
# examples
'a%'	Match strings that start with 'a'
'%a'	Match strings with end with 'a'
'a%t'	Match strings that contain the start with 'a' and end with 't'.
'%wow%'	Match strings that contain the substring 'wow' in them at any position.
'_wow%'	Match strings that contain the substring 'wow' in them at the second position.
'_a%'	Match strings that contain 'a' at the second position.
'a_ _%'	Match strings that start with 'a and contain at least 2 more characters.

## Null operators

In [ ]:
# NULL (missing or unknown) value
NULL

## Union operators

In [ ]:
# operator is used to combine the result sets of two or more SELECT queries into a single output. It removes duplicate rows and returns only unique records from all combined queries.
UNION

# includes all rows, even duplicates
UNION ALL

## Intersect operators

In [ ]:
# return only the records that appear in both of two SELECT query results. It acts like the intersection of two sets, showing only the common rows shared between them.
INTERSECT

## Except operators

In [ ]:
# operator returns rows from the first query that do not appear in the second. It works like subtracting one result set from another and is useful for identifying unmatched or missing records between tables
EXCEPT

## Case statement

In [ ]:
# add conditional logic inside SQL queries. It checks conditions one by one and returns a value as soon as a matching condition is found
CASE

# Works like an IF-THEN-ELSE statement inside SQL e.g.
CASE case_value
    WHEN value1 THEN result1
    WHEN value2 THEN result2
    ...
    ELSE result
END

# Aggregate Functions

In [ ]:
# count the number of rows
COUNT()
COUNT(*): Counts all rows.
COUNT(column_name): Counts non-NULL values in the specified column.
COUNT(DISTINCT column_name): Counts unique non-NULL values in the column.
    
# calculate the total of a numeric column. It adds up all non-NULL values in that column
SUM()

# calculate average value of a numeric column. It divides sum of all non-NULL values by the number of non-NULL rows
AVG()
AVG(DISTINCT column_name): computes the average only from unique non-NULL salary values.

# return the smallest and largest values, respectively
MIN()
MAX()

# Data Constraints

In [ ]:
# ensures a column must always contain a value and cannot be left empty
NOT NULL

# uniquely identifies each record in a table and ensures strong data integrity. It prevents duplicate and NULL values, making it essential for reliable relational database design
PRIMARY KEY

# primary key made from two or more columns that together uniquely identify each record in a table. Individually, these columns may not be unique, but their combined values ensure uniqueness
composite key

# candidate key not selected as the primary key. So, while a table may have multiple candidate keys (sets of columns that could uniquely identify rows), only one of them is designated as the Primary Key. The rest of these candidate keys become Alternate Keys.
alternate Key

# enforces a valid relationship between two tables by ensuring that the values stored in the child table correspond to existing values in the parent table
FOREIGN KEY

# Uses CASCADE or RESTRICT rules to control related data changes
CASCADE : an action triggered automatically when a change occurs in a parent table, propagating the update or deletion to the related child table
RESTRICT : ensures that you cannot delete a "parent" record if there are "child" records still pointing to it
    
# values in a column or set of columns are distinct, preventing duplicates. Unlike a PRIMARY KEY, it allows multiple NULL values since each NULL is treated as unique, while a primary key requires all values to be unique and non-NULL.
UNIQUE

# enforces rules on column values by limiting the data that can be inserted or updated. It ensures that values meet specified conditions. If a value violates the condition, the operation is rejected. CHECK can be added during table creation or modification.
CHECK

# provide a default value for a column when no value is specified during an INSERT operation. If a column has a DEFAULT constraint and no value is explicitly provided during the insertion of a record, the database will automatically insert the default value defined for that column.
DEFAULT

# SQL Joins

# SQL Functions

# SQL Views

# SQL Indexes

# SQL Subquery